---
type: AssemblyMemberDifferentCategory
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# AssemblyMemberDifferentCategory

`Autodesk.Revit.DB.AssemblyMemberDifferentCategory` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | CategoryId1 | 2012 | `public ElementId CategoryId1 { get ; }` |
| Property | CategoryId2 | 2012 | `public ElementId CategoryId2 { get ; }` |